Tekla Open API Reference for Tekla Structures 2025
ViewBase.GetObjects Method (Type[])
 Gets the objects in the view that are of certain types. Does not return child objects (single dimensions, grid lines, views).
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DrawingObjectEnumerator GetObjects(
	Type[] TypeFilter
)
Public Function GetObjects (
	TypeFilter As Type()
) As DrawingObjectEnumerator
Parameters
TypeFilter
Type: System.Type[]
The types of the objects to get.
Return Value
Type: DrawingObjectEnumerator
The objects in the view that are of certain types.
Implements
IHasChildren.GetObjects(Type[])
See Also
Reference
ViewBase Class
GetObjects Overload
Tekla.Structures.Drawing Namespace